Управление_по_целям_и_KPI/src/Documents/KPI_Невыходы/KPI_Невыходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_Невыходы</name>
  <registerRecords>AccumulationRegister.KPI_РабочееВремяСотрудников</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.KPI_Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
</mdclass:Document>

Управление_по_целям_и_KPI/src/AccumulationRegisters/KPI_РабочееВремяСотрудников/KPI_РабочееВремяСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>KPI_РабочееВремяСотрудников</name>
  <resources>
    <name>Часов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Явка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_по_целям_и_KPI/src/Documents/KPI_Невыходы/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр KPI_РабочееВремяСотрудников Приход	
	
	Движения.KPI_РабочееВремяСотрудников.Записывать = Истина;
	Движения.KPI_РабочееВремяСотрудников.Записать();
	
	ВыборкаСотрудник = KPI_ИнтерфейсВызовСервера.РабочееВремяСотрудников(НачалоПериода,КонецПериода,Сотрудник);
				
	Пока ВыборкаСотрудник.Следующий() Цикл
		ВыборкаРабочиеЧасы = ВыборкаСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока  ВыборкаРабочиеЧасы.Следующий() Цикл
			Движение             = Движения.KPI_РабочееВремяСотрудников.Добавить();
			Движение.Период      = ВыборкаРабочиеЧасы.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Сотрудник   = ВыборкаРабочиеЧасы.Сотрудник;
			Движение.Часов       = ВыборкаРабочиеЧасы.Часы;
			Движение.Явка        = Ложь;
		КонецЦикла;
	КонецЦикла;
			
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КонецПериода = КонецДня(КонецПериода);
	
КонецПроцедуры
